{"config": [{"config": {"nb_row": 5, "nb_filter": 128, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "nb_col": 5, "init": "uniform", "batch_input_shape": [null, 1, 15, 9], "subsample": [1, 1], "activation": "relu", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_filter": 128, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "init": "uniform", "subsample": [1, 1], "activation": "relu", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_filter": 128, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "init": "uniform", "subsample": [1, 1], "activation": "relu", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_filter": 128, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "init": "uniform", "subsample": [1, 1], "activation": "relu", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_filter": 128, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "init": "uniform", "subsample": [1, 1], "activation": "relu", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_filter": 128, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_6", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "init": "uniform", "subsample": [1, 1], "activation": "relu", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 1, "nb_filter": 1, "trainable": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_7", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_col": 1, "init": "uniform", "subsample": [1, 1], "activation": "linear", "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "output_dim": 128, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "output_dim": 9252, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}