{"loss": "categorical_crossentropy", "sample_weight_mode": null, "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_col": 5, "nb_row": 5, "activity_regularizer": null, "batch_input_shape": [null, 1, 11, 9], "input_dtype": "float32", "b_regularizer": null, "nb_filter": 128, "bias": true, "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "border_mode": "same", "W_constraint": null, "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "border_mode": "same", "W_constraint": null, "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "border_mode": "same", "W_constraint": null, "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "border_mode": "same", "W_constraint": null, "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_6", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "border_mode": "same", "W_constraint": null, "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_7", "nb_col": 1, "nb_row": 1, "nb_filter": 1, "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "border_mode": "same", "W_constraint": null, "trainable": true, "dim_ordering": "th", "init": "uniform", "b_constraint": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 128, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 9252, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}}], "keras_version": "1.0.5", "class_name": "Sequential", "optimizer": {"name": "Adam", "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-08}}
